Masmiseim36/nxpSDK/devices/MK65F18/cmsis_drivers/fsl_dspi_cmsis.c
static int32_t DSPI0_InterruptPowerControl(ARM_POWER_STATE state)
{
    return DSPI_InterruptPowerControl(state, &DSPI0_InterruptDriverState);
}

static int32_t DSPI0_InterruptSend(const void *data, uint32_t num)
{
    return DSPI_InterruptSend(data, num, &DSPI0_InterruptDriverState);
}

static int32_t DSPI0_InterruptReceive(void *data, uint32_t num)
{
    return DSPI_InterruptReceive(data, num, &DSPI0_InterruptDriverState);
}

static int32_t DSPI0_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return DSPI_InterruptTransfer(data_out, data_in, num, &DSPI0_InterruptDriverState);
}

static uint32_t DSPI0_InterruptGetCount(void)
{
    return DSPI_InterruptGetCount(&DSPI0_InterruptDriverState);
}

static int32_t DSPI0_InterruptControl(uint32_t control, uint32_t arg)
{
    return DSPI_InterruptControl(control, arg, &DSPI0_InterruptDriverState);
}

static ARM_SPI_STATUS DSPI0_InterruptGetStatus(void)
{
    return DSPI_InterruptGetStatus(&DSPI0_InterruptDriverState);
}

ARM_DRIVER_SPI DSPI0_Interrupt_Driver = {DSPIx_GetVersion,
                                         DSPIx_GetCapabilities,
                                         DSPI0_InterruptInitialize,
                                         DSPI0_InterruptUninitialize,
                                         DSPI0_InterruptPowerControl,
                                         DSPI0_InterruptSend,
                                         DSPI0_InterruptReceive,
                                         DSPI0_InterruptTransfer,
                                         DSPI0_InterruptGetCount,
                                         DSPI0_InterruptControl,
                                         DSPI0_InterruptGetStatus};

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
cmsis_dspi_edma_resource_t DSPI0_EdmaResource = {
    RTE_DSPI0_DMA_TX_DMA_BASE,   RTE_DSPI0_DMA_TX_CH,  RTE_DSPI0_DMA_TX_DMAMUX_BASE, RTE_DSPI0_DMA_TX_PERI_SEL,

    RTE_DSPI0_DMA_RX_DMA_BASE,   RTE_DSPI0_DMA_RX_CH,  RTE_DSPI0_DMA_RX_DMAMUX_BASE, RTE_DSPI0_DMA_RX_PERI_SEL,

    RTE_DSPI0_DMA_LINK_DMA_BASE, RTE_DSPI0_DMA_LINK_CH};

cmsis_dspi_edma_handle_t DSPI0_EdmaHandle;

edma_handle_t DSPI0_EdmaRxRegToRxDataHandle;
edma_handle_t DSPI0_EedmaTxDataToIntermediaryHandle;
edma_handle_t DSPI0_EedmaIntermediaryToTxRegHandle;
edma_handle_t DSPI0_EedmaTxDataToTxRegHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("dspi0_edma_driver_state")
cmsis_dspi_edma_driver_state_t DSPI0_EdmaDriverState = {
#else
cmsis_dspi_edma_driver_state_t DSPI0_EdmaDriverState = {
#endif
    &DSPI0_Resource,
    &DSPI0_EdmaResource,
    &DSPI0_EdmaHandle,
    &DSPI0_EdmaRxRegToRxDataHandle,
    &DSPI0_EedmaTxDataToIntermediaryHandle,
    &DSPI0_EedmaIntermediaryToTxRegHandle,
    &DSPI0_EedmaTxDataToTxRegHandle,
};

static int32_t DSPI0_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    DSPI0_InitPins();
    return DSPI_EdmaInitialize(cb_event, &DSPI0_EdmaDriverState);
}

static int32_t DSPI0_EdmaUninitialize(void)
{
    DSPI0_DeinitPins();
    return DSPI_EdmaUninitialize(&DSPI0_EdmaDriverState);
}

static int32_t DSPI0_EdmaPowerControl(ARM_POWER_STATE state)
{
    return DSPI_EdmaPowerControl(state, &DSPI0_EdmaDriverState);
}

static int32_t DSPI0_EdmaSend(const void *data, uint32_t num)
{
    return DSPI_EdmaSend(data, num, &DSPI0_EdmaDriverState);
}

static int32_t DSPI0_EdmaReceive(void *data, uint32_t num)
{
    return DSPI_EdmaReceive(data, num, &DSPI0_EdmaDriverState);
}

static int32_t DSPI0_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return DSPI_EdmaTransfer(data_out, data_in, num, &DSPI0_EdmaDriverState);
}

static uint32_t DSPI0_EdmaGetCount(void)
{
    return DSPI_EdmaGetCount(&DSPI0_EdmaDriverState);
}

static int32_t DSPI0_EdmaControl(uint32_t control, uint32_t arg)
{
    return DSPI_EdmaControl(control, arg, &DSPI0_EdmaDriverState);
}

static ARM_SPI_STATUS DSPI0_EdmaGetStatus(void)
{
    return DSPI_EdmaGetStatus(&DSPI0_EdmaDriverState);
}

ARM_DRIVER_SPI DSPI0_Edma_Driver = {DSPIx_GetVersion,       DSPIx_GetCapabilities,  DSPI0_EdmaInitialize,
                                    DSPI0_EdmaUninitialize, DSPI0_EdmaPowerControl, DSPI0_EdmaSend,
                                    DSPI0_EdmaReceive,      DSPI0_EdmaTransfer,     DSPI0_EdmaGetCount,
                                    DSPI0_EdmaControl,      DSPI0_EdmaGetStatus};
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */

#endif /*  DSPI0  */

#if defined(DSPI1)

extern uint32_t DSPI1_GetFreq(void);
extern void DSPI1_InitPins(void);
extern void DSPI1_DeinitPins(void);

cmsis_dspi_resource_t DSPI1_Resource = {DSPI1, 1, DSPI1_GetFreq};

cmsis_dspi_handle_t DSPI1_Handle;

#if defined(__CC_ARM)
ARMCC_SECTION("dspi1_interrupt_driver_state")
cmsis_dspi_interrupt_driver_state_t DSPI1_InterruptDriverState = {
#else
cmsis_dspi_interrupt_driver_state_t DSPI1_InterruptDriverState = {
#endif
    &DSPI1_Resource, &DSPI1_Handle,
};

static int32_t DSPI1_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    DSPI1_InitPins();
    return DSPI_InterruptInitialize(cb_event, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptUninitialize(void)
{
    DSPI1_DeinitPins();
    return DSPI_InterruptUninitialize(&DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptPowerControl(ARM_POWER_STATE state)
{
    return DSPI_InterruptPowerControl(state, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptSend(const void *data, uint32_t num)
{
    return DSPI_InterruptSend(data, num, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptReceive(void *data, uint32_t num)
{
    return DSPI_InterruptReceive(data, num, &DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return DSPI_InterruptTransfer(data_out, data_in, num, &DSPI1_InterruptDriverState);
}

static uint32_t DSPI1_InterruptGetCount(void)
{
    return DSPI_InterruptGetCount(&DSPI1_InterruptDriverState);
}

static int32_t DSPI1_InterruptControl(uint32_t control, uint32_t arg)
{
    return DSPI_InterruptControl(control, arg, &DSPI1_InterruptDriverState);
}

static ARM_SPI_STATUS DSPI1_InterruptGetStatus(void)
{
    return DSPI_InterruptGetStatus(&DSPI1_InterruptDriverState);
}

ARM_DRIVER_SPI DSPI1_Interrupt_Driver = {DSPIx_GetVersion,
                                         DSPIx_GetCapabilities,
                                         DSPI1_InterruptInitialize,
                                         DSPI1_InterruptUninitialize,
                                         DSPI1_InterruptPowerControl,
                                         DSPI1_InterruptSend,
                                         DSPI1_InterruptReceive,
                                         DSPI1_InterruptTransfer,
                                         DSPI1_InterruptGetCount,
                                         DSPI1_InterruptControl,
                                         DSPI1_InterruptGetStatus};

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
cmsis_dspi_edma_resource_t DSPI1_EdmaResource = {
    RTE_DSPI1_DMA_TX_DMA_BASE,   RTE_DSPI1_DMA_TX_CH,  RTE_DSPI1_DMA_TX_DMAMUX_BASE, RTE_DSPI1_DMA_TX_PERI_SEL,

    RTE_DSPI1_DMA_RX_DMA_BASE,   RTE_DSPI1_DMA_RX_CH,  RTE_DSPI1_DMA_RX_DMAMUX_BASE, RTE_DSPI1_DMA_RX_PERI_SEL,

    RTE_DSPI1_DMA_LINK_DMA_BASE, RTE_DSPI1_DMA_LINK_CH};

